#include "bmp.h"
#include "music.h"
#include "screen.h"
#include "ts.h"
#include "video.h"

/*********************************************************************************************/
/****************************************主程序************************************************/
/********************************************************************************************/

int main(int argc, const char *argv[])
{
    int ts_x, ts_y;
    int v = 0;
    int k = 0;
    int i = 0;

    char bmp_path[5][10] = {"./p1.bmp", "./p2.bmp", "./p3.bmp", "./p4.bmp", "./p5.bmp"}; // 相册
    char music_pitc[4][10] = {"./1.bmp", "./2.bmp", "./3.bmp", "./4.bmp"};               // 音乐图片目录
    char music_path[4][10] = {"./1.mp3", "./2.mp3", "./3.mp3", "./4.mp3"};               // 音乐
    char video_path[2][10] = {"./1.mp4", "./2.mp4"};                                     // 视频

    open_lcd_screen();
    open_ts();
    open_movie_pipe();
    show_bmp("./main.bmp");

    while (1)
    {
        get_ts_xy(&ts_x, &ts_y);
        printf("(%d,%d)\n", ts_x, ts_y);

        /*****************************************************************************************************/
        /****************************************电子相册******************************************************/
        /*****************************************************************************************************/
        if (ts_x > 120 && ts_x < 270 && ts_y > 230 && ts_y < 370)
        {
            show_bmp("./p1.bmp");

            while (1)
            {
                get_ts_xy(&ts_x, &ts_y); // 更新触摸屏事件
                if (ts_x > 0 && ts_x < 500 && ts_y > 70 && ts_y < 600)
                {
                    k--;
                    if (k == -1)
                    {
                        k = 4;
                    }
                    show_bmp(bmp_path[k]);
                }

                if (ts_x > 500 && ts_x < 1024 && ts_y > 0 && ts_y < 600)
                {
                    k++;
                    if (k == 5)
                    {
                        k = 0;
                    }
                    show_bmp(bmp_path[k]);
                }

                // 返回主界面
                if (ts_x > 0 && ts_x < 120 && ts_y > 0 && ts_y < 70)
                {
                    show_bmp("./main.bmp");
                    break;
                }
            }
        }

        /***************************************************************************************************/
        /******************************************音乐播放**************************************************/
        /**************************************************************************************************/
        if (ts_x > 360 && ts_x < 520 && ts_y > 230 && ts_y < 370)
        {
            show_bmp("./1.bmp");

            while (1)
            {
                get_ts_xy(&ts_x, &ts_y); // 更新触摸屏事件

                //=================================列表播放========================================//
                if (ts_x > 820 && ts_x < 1024 && ts_y > 0 && ts_y < 70) //============第一首
                {
                    exit_music();
                    show_bmp("./1.bmp");
                    start_music("./1.mp3");
                }

                if (ts_x > 820 && ts_x < 1024 && ts_y > 70 && ts_y < 140) //============第二首
                {
                    exit_music();
                    show_bmp("./2.bmp");
                    start_music("./2.mp3");
                }

                if (ts_x > 820 && ts_x < 1024 && ts_y > 140 && ts_y < 210) //============第三首
                {
                    exit_music();
                    show_bmp("./3.bmp");
                    start_music("./3.mp3");
                }

                if (ts_x > 820 && ts_x < 1024 && ts_y > 210 && ts_y < 280) //============第四首
                {
                    exit_music();
                    show_bmp("./4.bmp");
                    start_music("./4.mp3");
                }

                //=====================================上一首，下一首====================//
                if (ts_x > 650 && ts_x < 700 && ts_y > 500 && ts_y < 590) //=============上一首
                {
                    exit_music();
                    printf("上一首 \n");
                    i--;
                    if (i == -1)
                    {
                        i = 3;
                    }
                    start_music(music_path[i]);
                    show_bmp(music_pitc[i]);
                }

                if (ts_x > 736 && ts_x < 780 && ts_y > 500 && ts_y < 590) //=============下一首
                {
                    exit_music();
                    printf("下一首 \n");
                    i++;
                    if (i == 4)
                    {
                        i = 0;
                    }
                    start_music(music_path[i]);
                    show_bmp(music_pitc[i]);
                }

                if (ts_x > 55 && ts_x < 145 && ts_y > 490 && ts_y < 600) //=============停止音乐
                {
                    printf("停止音乐 \n");
                    stop_music();
                }
                if (ts_x > 250 && ts_x < 350 && ts_y > 490 && ts_y < 600) //===========继续音乐
                {
                    printf("继续音乐 \n");
                    cont_music();
                }

                // 返回主界面
                if (ts_x > 880 && ts_x < 980 && ts_y > 490 && ts_y < 600)
                {
                    exit_music();
                    show_bmp("./main.bmp");
                    ts_x = 0;
                    ts_y = 0;
                    break;
                }
            }
        }
        /*********************************************************************************************/
        /****************************************视频播放**********************************************/
        /********************************************************************************************/
        if (ts_x > 635 && ts_x < 770 && ts_y > 230 && ts_y < 370)
        {
            show_bmp("./video.bmp");

            while (1)
            {
                get_ts_xy(&ts_x, &ts_y); // 更新触摸屏事件

                // 播放默认视频1
                if (ts_x > 0 && ts_x < 190 && ts_y > 500 && ts_y < 600)
                {
                    show_bmp("./video1.bmp");
                    send_cmd_pipe(1);
                    start_movie("./1.mp4", 100, 100, 1024, 500);
                }

                // 下一个视频
                if (ts_x > 700 && ts_x < 815 && ts_y > 500 && ts_y < 600)
                {
                    
                    show_bmp("./video1.bmp");
                    send_cmd_pipe(1);
                    v+=1;
                    if (v == 2)
                        v = 0;
                    start_movie(video_path[v], 100, 100, 1024, 500);
                }

                // 上一个视频
                if (ts_x > 200 && ts_x < 300 && ts_y > 500 && ts_y < 600)
                {
                    show_bmp("./video2.bmp");
                    send_cmd_pipe(1);
                    v-=1;
                    if (v == -1)
                        v = 1;
                    start_movie(video_path[v], 100, 100, 1024, 500);
                }

                // 视频暂停或继续
                if (ts_x > 452 && ts_x < 555 && ts_y > 500 && ts_y < 600)
                {

                    send_cmd_pipe(2);
                }

                // 增加音量
                if (ts_x > 835 && ts_x < 910 && ts_y > 500 && ts_y < 600)
                {

                    send_cmd_pipe(3);
                }

                // 减少音量
                if (ts_x > 920 && ts_x < 1024 && ts_y > 500 && ts_y < 600)
                {

                    send_cmd_pipe(4);
                }

                // 快退5秒
                if (ts_x > 330 && ts_x < 440 && ts_y > 500 && ts_y < 600)
                {
                    send_cmd_pipe(5);
                }

                // 快进5秒
                if (ts_x > 580 && ts_x < 690 && ts_y > 500 && ts_y < 600)
                {
                    send_cmd_pipe(6);
                }

                // 返回主界面
                if (ts_x > 0 && ts_x < 120 && ts_y > 0 && ts_y < 70)
                {
                    send_cmd_pipe(1);
                    show_bmp("./main.bmp");
                    break;
                }
            }
        }
    }

    close_lcd_screen();
    close_ts();

    return 0;
}
